system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
forceCoeffs1
{
    type        forceCoeffs;

    libs (forces);

    writeControl   timeStep;
    timeInterval    1;

    log         yes;

    patches     ( ahmedGroup );
    rho     rhoInf;      // Indicates incompressible
    rhoInf      1;           // Redundant for incompressible
    liftDir     (0 0 1);
    dragDir     (1 0 0);
    CofR        (-0.502 0 0);  // Axle midpoint on ground
    pitchAxis   (0 1 0);
    magUInf     1;
    lRef        1.04;        // Wheelbase length
    Aref        0.112032;        // Estimated
}


// ************************************************************************* //
