system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \    /   O peration     | Version:  v2112
|   \  /    A nd           | Web:      www.OpenFOAM.org
|    \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


damp
{
    type    velocityDampingConstraint;
    active  true;

    velocityDampingConstraintCoeffs
    {
         UMax           2.0;
         selectionMode  all;
    }
}

// ************************************************************************* //
