system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \    /   O peration     | Version:  v2112
|   \  /    A nd           | Web:      www.OpenFOAM.org
|    \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default steadyState;
}

d2dt2Schemes
{
}

gradSchemes
{
    default         Gauss linear;
    grad(k)         cellLimited Gauss linear 0.5;    // Relaxed limiter
    grad(omega)     cellLimited Gauss linear 0.5;    // Relaxed limiter
    grad(U)         cellLimited Gauss linear 0.5;    // Relaxed limiter
    grad(p)         cellLimited Gauss linear 1.0;    // Keep pressure gradient fully limited
}

divSchemes
{
    default                         Gauss linear;
    
    // Replace hybrid DES scheme with standard RANS scheme
    div(phi,U)                      Gauss linearUpwind grad(U);
    
    // Keep turbulence transport schemes (k-omega SST needs these)
    div(phi,k)                      Gauss linearUpwind grad(k);
    div(phi,omega)                  Gauss linearUpwind grad(omega);
    
    // Keep this unchanged from original
    div((nuEff*dev(grad(U).T())))   Gauss linear;
    
    // Keep passive scalar transport if needed
    "div\(phi,passiveScalar.*\)"    Gauss upwind;
}

laplacianSchemes
{
    default Gauss linear limited corrected 0.5;
    laplacian(diffusivity,cellDisplacement) Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    interpolate(HbyA)   linear;
}

snGradSchemes
{
    default limited 0.5;
}

fluxRequired
{
    default no;
    p;
}

wallDist
{
    method      meshWave;
    nRequired   false;
}

// ************************************************************************* //
